# Завдання 3. Практикум зі зрізів
s = "З усіх утрат втрата часу найважча."

# Від початку і до кінця
print(s[:])

# Від 20-го символа і до кінця
print(s[20:])

# Від 12-го символа по 15-й (15-й не включається)
print(s[12:15])

# Останні 5 символів
print(s[-5:])

# Від 18-го символа і до 3-го з кінця (-3)
print(s[18:-3])

# Від 6-го символа з кінця (-6) і до 2-го з кінця (-2)
print(s[-6:-2])

# Кожний 7-й символ від початку і до кінця
print(s[::7])

# Кожний 3-й символ від 4-го символа до 20-го
print(s[4:20:3])

# Кожний 4-й символ починаючи від 19-го до кінця
print(s[19::4])

# Кожний 5-й символ від початку до 21-го
print(s[:21:5])

# Перевернути рядок з кінця на початок
print(s[::-1])